<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"d1b8c8d2ff68e2ff5cd21c27c54429ff554d233b1192a5b905de16aa42e1716e","plan_job_ref":"Job Terraform Plan #70 at https://github.com/ironashram/kub1k/actions/runs/8545478038","plan_out_hash":"b4f5d92553416bccb5ad7f551b6f26619d881d36f429139785b324433adfa334","plan_hash":"1a38f57bcdf228cd36b283ba4a960f7856dc9009dc15051ca4f748f52ab5bbf5","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 4 to add, 1 to change, 4 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_control["kub1k-control-01"] must be replaced
-/+ resource "null_resource" "k3s_control" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "md5_vars" = "3619e9cdd016a71157a8c95d220c7bec" -> "0e367c76ee26f293899d06d68e8d39d8"
#            (1 unchanged element hidden)
        }
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-04-01T11:58:22Z" -> (known after apply)
        }
    }

  # module.provision_k3s.null_resource.k3s_worker["kub1k-worker-01"] must be replaced
-/+ resource "null_resource" "k3s_worker" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "md5_vars" = "3619e9cdd016a71157a8c95d220c7bec" -> "0e367c76ee26f293899d06d68e8d39d8"
#            (1 unchanged element hidden)
        }
    }

  # module.provision_k3s.null_resource.k3s_worker["kub1k-worker-02"] must be replaced
-/+ resource "null_resource" "k3s_worker" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "md5_vars" = "3619e9cdd016a71157a8c95d220c7bec" -> "0e367c76ee26f293899d06d68e8d39d8"
#            (1 unchanged element hidden)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #70](https://github.com/ironashram/kub1k/actions/runs/8545478038)